adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_i2c_cmsis.c
static i2c_master_dma_handle_t I2C1_DmaHandle;
static dma_handle_t I2C1_DmaTxRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c1_dma_driver_state")
static cmsis_i2c_dma_driver_state_t I2C1_DmaDriverState = {
#else
static cmsis_i2c_dma_driver_state_t I2C1_DmaDriverState = {
    #endif
    &I2C1_Resource,
    &I2C1_DmaResource,
    &I2C1_DmaHandle,
    &I2C1_DmaTxRxHandle,
};

static int32_t I2C1_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event) {
    #ifdef RTE_I2C1_PIN_INIT
    RTE_I2C1_PIN_INIT();
    #endif
    return I2C_Master_DmaInitialize(cb_event, &I2C1_DmaDriverState);
}

static int32_t I2C1_Master_DmaUninitialize(void) {
    #ifdef RTE_I2C1_PIN_DEINIT
    RTE_I2C1_PIN_DEINIT();
    #endif
    return I2C_Master_DmaUninitialize(&I2C1_DmaDriverState);
}

static int32_t I2C1_Master_DmaPowerControl(ARM_POWER_STATE state) {
    return I2C_Master_DmaPowerControl(state, &I2C1_DmaDriverState);
}

static int32_t I2C1_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C1_DmaDriverState);
}

static int32_t I2C1_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C1_DmaDriverState);
}

static int32_t I2C1_Master_DmaGetDataCount(void) {
    return I2C_Master_DmaGetDataCount(&I2C1_DmaDriverState);
}

static int32_t I2C1_Master_DmaControl(uint32_t control, uint32_t arg) {
    return I2C_Master_DmaControl(control, arg, &I2C1_DmaDriverState);
}

static ARM_I2C_STATUS I2C1_Master_DmaGetStatus(void) {
    return I2C_Master_DmaGetStatus(&I2C1_DmaDriverState);
}

#endif

#else

static cmsis_i2c_handle_t I2C1_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c1_interrupt_driver_state")
static cmsis_i2c_interrupt_driver_state_t I2C1_InterruptDriverState = {
#else
static cmsis_i2c_interrupt_driver_state_t I2C1_InterruptDriverState = {
    #endif
    &I2C1_Resource,
    &I2C1_Handle,
};

static int32_t I2C1_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event) {
    #ifdef RTE_I2C1_PIN_INIT
    RTE_I2C1_PIN_INIT();
    #endif
    return I2C_InterruptInitialize(cb_event, &I2C1_InterruptDriverState);
}

static int32_t I2C1_InterruptUninitialize(void) {
    #ifdef RTE_I2C1_PIN_DEINIT
    RTE_I2C1_PIN_DEINIT();
    #endif
    return I2C_InterruptUninitialize(&I2C1_InterruptDriverState);
}

static int32_t I2C1_InterruptPowerControl(ARM_POWER_STATE state) {
    return I2C_InterruptPowerControl(state, &I2C1_InterruptDriverState);
}

static int32_t I2C1_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C1_InterruptDriverState);
}

static int32_t I2C1_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C1_InterruptDriverState);
}

static int32_t I2C1_Slave_InterruptTransmit(const uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptTransmit(data, num, &I2C1_InterruptDriverState);
}

static int32_t I2C1_Slave_InterruptReceive(uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptReceive(data, num, &I2C1_InterruptDriverState);
}

static int32_t I2C1_InterruptGetDataCount(void) {
    return I2C_InterruptGetDataCount(&I2C1_InterruptDriverState);
}

static int32_t I2C1_InterruptControl(uint32_t control, uint32_t arg) {
    return I2C_InterruptControl(control, arg, &I2C1_InterruptDriverState);
}

static ARM_I2C_STATUS I2C1_InterruptGetStatus(void) {
    return I2C_InterruptGetStatus(&I2C1_InterruptDriverState);
}

#endif

ARM_DRIVER_I2C Driver_I2C1 = {I2Cx_GetVersion,
                              I2Cx_GetCapabilities,
                              #if defined(RTE_I2C1_DMA_EN) && RTE_I2C1_DMA_EN
                              I2C1_Master_DmaInitialize,
                              I2C1_Master_DmaUninitialize,
                              I2C1_Master_DmaPowerControl,
                              I2C1_Master_DmaTransmit,
                              I2C1_Master_DmaReceive,
                              NULL,
                              NULL,
                              I2C1_Master_DmaGetDataCount,
                              I2C1_Master_DmaControl,
                              I2C1_Master_DmaGetStatus
                              #else
                              I2C1_InterruptInitialize,
                              I2C1_InterruptUninitialize,
                              I2C1_InterruptPowerControl,
                              I2C1_Master_InterruptTransmit,
                              I2C1_Master_InterruptReceive,
                              I2C1_Slave_InterruptTransmit,
                              I2C1_Slave_InterruptReceive,
                              I2C1_InterruptGetDataCount,
                              I2C1_InterruptControl,
                              I2C1_InterruptGetStatus
                              #endif
};

#endif

#if defined(I2C2) && defined(RTE_I2C2) && RTE_I2C2

/* User needs to provide the implementation for I2C2_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t I2C2_GetFreq(void);

static cmsis_i2c_resource_t I2C2_Resource = {I2C2, I2C2_GetFreq};

#if (defined(RTE_I2C2_DMA_EN) && RTE_I2C2_DMA_EN)

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_i2c_dma_resource_t I2C2_DmaResource = {RTE_I2C2_Master_DMA_BASE, RTE_I2C2_Master_DMA_CH};

static i2c_master_dma_handle_t I2C2_DmaHandle;
static dma_handle_t I2C2_DmaTxRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c2_dma_driver_state")
static cmsis_i2c_dma_driver_state_t I2C2_DmaDriverState = {
#else
static cmsis_i2c_dma_driver_state_t I2C2_DmaDriverState = {
    #endif
    &I2C2_Resource,
    &I2C2_DmaResource,
    &I2C2_DmaHandle,
    &I2C2_DmaTxRxHandle,
};

static int32_t I2C2_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event) {
    #ifdef RTE_I2C2_PIN_INIT
    RTE_I2C2_PIN_INIT();
    #endif
    return I2C_Master_DmaInitialize(cb_event, &I2C2_DmaDriverState);
}

