adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_i2c_cmsis.c
static int32_t I2C2_Master_DmaUninitialize(void) {
    #ifdef RTE_I2C2_PIN_DEINIT
    RTE_I2C2_PIN_DEINIT();
    #endif
    return I2C_Master_DmaUninitialize(&I2C2_DmaDriverState);
}

static int32_t I2C2_Master_DmaPowerControl(ARM_POWER_STATE state) {
    return I2C_Master_DmaPowerControl(state, &I2C2_DmaDriverState);
}

static int32_t I2C2_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C2_DmaDriverState);
}

static int32_t I2C2_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C2_DmaDriverState);
}

static int32_t I2C2_Master_DmaGetDataCount(void) {
    return I2C_Master_DmaGetDataCount(&I2C2_DmaDriverState);
}

static int32_t I2C2_Master_DmaControl(uint32_t control, uint32_t arg) {
    return I2C_Master_DmaControl(control, arg, &I2C2_DmaDriverState);
}

static ARM_I2C_STATUS I2C2_Master_DmaGetStatus(void) {
    return I2C_Master_DmaGetStatus(&I2C2_DmaDriverState);
}

#endif

#else

static cmsis_i2c_handle_t I2C2_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c2_interrupt_driver_state")
static cmsis_i2c_interrupt_driver_state_t I2C2_InterruptDriverState = {
#else
static cmsis_i2c_interrupt_driver_state_t I2C2_InterruptDriverState = {
    #endif
    &I2C2_Resource,
    &I2C2_Handle,

};

static int32_t I2C2_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event) {
    #ifdef RTE_I2C2_PIN_INIT
    RTE_I2C2_PIN_INIT();
    #endif
    return I2C_InterruptInitialize(cb_event, &I2C2_InterruptDriverState);
}

static int32_t I2C2_InterruptUninitialize(void) {
    #ifdef RTE_I2C2_PIN_DEINIT
    RTE_I2C2_PIN_DEINIT();
    #endif
    return I2C_InterruptUninitialize(&I2C2_InterruptDriverState);
}

static int32_t I2C2_InterruptPowerControl(ARM_POWER_STATE state) {
    return I2C_InterruptPowerControl(state, &I2C2_InterruptDriverState);
}

static int32_t I2C2_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C2_InterruptDriverState);
}

static int32_t I2C2_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C2_InterruptDriverState);
}

static int32_t I2C2_Slave_InterruptTransmit(const uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptTransmit(data, num, &I2C2_InterruptDriverState);
}

static int32_t I2C2_Slave_InterruptReceive(uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptReceive(data, num, &I2C2_InterruptDriverState);
}

static int32_t I2C2_InterruptGetDataCount(void) {
    return I2C_InterruptGetDataCount(&I2C2_InterruptDriverState);
}

static int32_t I2C2_InterruptControl(uint32_t control, uint32_t arg) {
    return I2C_InterruptControl(control, arg, &I2C2_InterruptDriverState);
}

static ARM_I2C_STATUS I2C2_InterruptGetStatus(void) {
    return I2C_InterruptGetStatus(&I2C2_InterruptDriverState);
}

#endif

ARM_DRIVER_I2C Driver_I2C2 = {I2Cx_GetVersion,
                              I2Cx_GetCapabilities,
                              #if defined(RTE_I2C2_DMA_EN) && (RTE_I2C2_DMA_EN)
                              I2C2_Master_DmaInitialize,
                              I2C2_Master_DmaUninitialize,
                              I2C2_Master_DmaPowerControl,
                              I2C2_Master_DmaTransmit,
                              I2C2_Master_DmaReceive,
                              NULL,
                              NULL,
                              I2C2_Master_DmaGetDataCount,
                              I2C2_Master_DmaControl,
                              I2C2_Master_DmaGetStatus
                              #else
                              I2C2_InterruptInitialize,
                              I2C2_InterruptUninitialize,
                              I2C2_InterruptPowerControl,
                              I2C2_Master_InterruptTransmit,
                              I2C2_Master_InterruptReceive,
                              I2C2_Slave_InterruptTransmit,
                              I2C2_Slave_InterruptReceive,
                              I2C2_InterruptGetDataCount,
                              I2C2_InterruptControl,
                              I2C2_InterruptGetStatus
                              #endif
};

#endif

#if defined(I2C3) && defined(RTE_I2C3) && RTE_I2C3

/* User needs to provide the implementation for I2C3_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t I2C3_GetFreq(void);

static cmsis_i2c_resource_t I2C3_Resource = {I2C3, I2C3_GetFreq};

#if (defined(RTE_I2C3_DMA_EN) && RTE_I2C3_DMA_EN)

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_i2c_dma_resource_t I2C3_DmaResource = {RTE_I2C3_Master_DMA_BASE, RTE_I2C3_Master_DMA_CH};

static i2c_master_dma_handle_t I2C3_DmaHandle;
static dma_handle_t I2C3_DmaTxRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c3_dma_driver_state")
static cmsis_i2c_dma_driver_state_t I2C3_DmaDriverState = {
#else
static cmsis_i2c_dma_driver_state_t I2C3_DmaDriverState = {
    #endif
    &I2C3_Resource,
    &I2C3_DmaResource,
    &I2C3_DmaHandle,
    &I2C3_DmaTxRxHandle,
};

static int32_t I2C3_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event) {
    #ifdef RTE_I2C3_PIN_INIT
    RTE_I2C3_PIN_INIT();
    #endif
    return I2C_Master_DmaInitialize(cb_event, &I2C3_DmaDriverState);
}

static int32_t I2C3_Master_DmaUninitialize(void) {
    #ifdef RTE_I2C3_PIN_DEINIT
    RTE_I2C3_PIN_DEINIT();
    #endif
    return I2C_Master_DmaUninitialize(&I2C3_DmaDriverState);
}

static int32_t I2C3_Master_DmaPowerControl(ARM_POWER_STATE state) {
    return I2C_Master_DmaPowerControl(state, &I2C3_DmaDriverState);
}

static int32_t I2C3_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C3_DmaDriverState);
}

static int32_t I2C3_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C3_DmaDriverState);
}

