adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_i2c_cmsis.c
static int32_t I2C5_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C5_InterruptDriverState);
}

static int32_t I2C5_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C5_InterruptDriverState);
}

static int32_t I2C5_Slave_InterruptTransmit(const uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptTransmit(data, num, &I2C5_InterruptDriverState);
}

static int32_t I2C5_Slave_InterruptReceive(uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptReceive(data, num, &I2C5_InterruptDriverState);
}

static int32_t I2C5_InterruptGetDataCount(void) {
    return I2C_InterruptGetDataCount(&I2C5_InterruptDriverState);
}

static int32_t I2C5_InterruptControl(uint32_t control, uint32_t arg) {
    return I2C_InterruptControl(control, arg, &I2C5_InterruptDriverState);
}

static ARM_I2C_STATUS I2C5_InterruptGetStatus(void) {
    return I2C_InterruptGetStatus(&I2C5_InterruptDriverState);
}

#endif

ARM_DRIVER_I2C Driver_I2C5 = {I2Cx_GetVersion,
                              I2Cx_GetCapabilities,
                              #if defined(RTE_I2C5_DMA_EN) && RTE_I2C5_DMA_EN
                              I2C5_Master_DmaInitialize,
                              I2C5_Master_DmaUninitialize,
                              I2C5_Master_DmaPowerControl,
                              I2C5_Master_DmaTransmit,
                              I2C5_Master_DmaReceive,
                              NULL,
                              NULL,
                              I2C5_Master_DmaGetDataCount,
                              I2C5_Master_DmaControl,
                              I2C5_Master_DmaGetStatus
                              #else
                              I2C5_InterruptInitialize,
                              I2C5_InterruptUninitialize,
                              I2C5_InterruptPowerControl,
                              I2C5_Master_InterruptTransmit,
                              I2C5_Master_InterruptReceive,
                              I2C5_Slave_InterruptTransmit,
                              I2C5_Slave_InterruptReceive,
                              I2C5_InterruptGetDataCount,
                              I2C5_InterruptControl,
                              I2C5_InterruptGetStatus
                              #endif
};

#endif

#if defined(I2C6) && defined(RTE_I2C6) && RTE_I2C6
/* User needs to provide the implementation for I2C6_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t I2C6_GetFreq(void);

static cmsis_i2c_resource_t I2C6_Resource = {I2C6, I2C6_GetFreq};

#if (defined(RTE_I2C6_DMA_EN) && RTE_I2C6_DMA_EN)

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_i2c_dma_resource_t I2C6_DmaResource = {RTE_I2C6_Master_DMA_BASE, RTE_I2C6_Master_DMA_CH};

static i2c_master_dma_handle_t I2C6_DmaHandle;
static dma_handle_t I2C6_DmaTxRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c6_dma_driver_state")
static cmsis_i2c_dma_driver_state_t I2C6_DmaDriverState = {
#else
static cmsis_i2c_dma_driver_state_t I2C6_DmaDriverState = {
    #endif
    &I2C6_Resource,
    &I2C6_DmaResource,
    &I2C6_DmaHandle,
    &I2C6_DmaTxRxHandle,
};

static int32_t I2C6_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event) {
    #ifdef RTE_I2C6_PIN_INIT
    RTE_I2C6_PIN_INIT();
    #endif
    return I2C_Master_DmaInitialize(cb_event, &I2C6_DmaDriverState);
}

static int32_t I2C6_Master_DmaUninitialize(void) {
    #ifdef RTE_I2C6_PIN_DEINIT
    RTE_I2C6_PIN_DEINIT();
    #endif
    return I2C_Master_DmaUninitialize(&I2C6_DmaDriverState);
}

static int32_t I2C6_Master_DmaPowerControl(ARM_POWER_STATE state) {
    return I2C_Master_DmaPowerControl(state, &I2C6_DmaDriverState);
}

static int32_t I2C6_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C6_DmaDriverState);
}

static int32_t I2C6_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C6_DmaDriverState);
}

static int32_t I2C6_Master_DmaGetDataCount(void) {
    return I2C_Master_DmaGetDataCount(&I2C6_DmaDriverState);
}

static int32_t I2C6_Master_DmaControl(uint32_t control, uint32_t arg) {
    return I2C_Master_DmaControl(control, arg, &I2C6_DmaDriverState);
}

static ARM_I2C_STATUS I2C6_Master_DmaGetStatus(void) {
    return I2C_Master_DmaGetStatus(&I2C6_DmaDriverState);
}

#endif

#else

static cmsis_i2c_handle_t I2C6_handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c6_interrupt_driver_state")
static cmsis_i2c_interrupt_driver_state_t I2C6_InterruptDriverState = {
#else
static cmsis_i2c_interrupt_driver_state_t I2C6_InterruptDriverState = {
    #endif
    &I2C6_Resource,
    &I2C6_handle,

};

static int32_t I2C6_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event) {
    #ifdef RTE_I2C6_PIN_INIT
    RTE_I2C6_PIN_INIT();
    #endif
    return I2C_InterruptInitialize(cb_event, &I2C6_InterruptDriverState);
}

static int32_t I2C6_InterruptUninitialize(void) {
    #ifdef RTE_I2C6_PIN_DEINIT
    RTE_I2C6_PIN_DEINIT();
    #endif
    return I2C_InterruptUninitialize(&I2C6_InterruptDriverState);
}

static int32_t I2C6_InterruptPowerControl(ARM_POWER_STATE state) {
    return I2C_InterruptPowerControl(state, &I2C6_InterruptDriverState);
}

static int32_t I2C6_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C6_InterruptDriverState);
}

static int32_t I2C6_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C6_InterruptDriverState);
}

static int32_t I2C6_Slave_InterruptTransmit(const uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptTransmit(data, num, &I2C6_InterruptDriverState);
}

static int32_t I2C6_Slave_InterruptReceive(uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptReceive(data, num, &I2C6_InterruptDriverState);
}

static int32_t I2C6_InterruptGetDataCount(void) {
    return I2C_InterruptGetDataCount(&I2C6_InterruptDriverState);
}

static int32_t I2C6_InterruptControl(uint32_t control, uint32_t arg) {
    return I2C_InterruptControl(control, arg, &I2C6_InterruptDriverState);
}

static ARM_I2C_STATUS I2C6_InterruptGetStatus(void) {
    return I2C_InterruptGetStatus(&I2C6_InterruptDriverState);
}

#endif

ARM_DRIVER_I2C Driver_I2C6 = {I2Cx_GetVersion,
                              I2Cx_GetCapabilities,
                              #if defined(RTE_I2C6_DMA_EN) && RTE_I2C6_DMA_EN
                              I2C6_Master_DmaInitialize,
                              I2C6_Master_DmaUninitialize,
                              I2C6_Master_DmaPowerControl,
                              I2C6_Master_DmaTransmit,
                              I2C6_Master_DmaReceive,
                              NULL,
                              NULL,
                              I2C6_Master_DmaGetDataCount,
                              I2C6_Master_DmaControl,
                              I2C6_Master_DmaGetStatus
                              #else
                              I2C6_InterruptInitialize,
                              I2C6_InterruptUninitialize,
                              I2C6_InterruptPowerControl,
                              I2C6_Master_InterruptTransmit,
                              I2C6_Master_InterruptReceive,
                              I2C6_Slave_InterruptTransmit,
                              I2C6_Slave_InterruptReceive,
                              I2C6_InterruptGetDataCount,
                              I2C6_InterruptControl,
                              I2C6_InterruptGetStatus
                              #endif
};

#endif

