adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_i2c_cmsis.c
#if defined(I2C7) && defined(RTE_I2C7) && RTE_I2C7
/* User needs to provide the implementation for I2C7_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t I2C7_GetFreq(void);

static cmsis_i2c_resource_t I2C7_Resource = {I2C7, I2C7_GetFreq};

#if (defined(RTE_I2C7_DMA_EN) && RTE_I2C7_DMA_EN)

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_i2c_dma_resource_t I2C7_DmaResource = {RTE_I2C7_Master_DMA_BASE, RTE_I2C7_Master_DMA_CH};

static i2c_master_dma_handle_t I2C7_DmaHandle;
static dma_handle_t I2C7_DmaTxRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c7_dma_driver_state")
static cmsis_i2c_dma_driver_state_t I2C7_DmaDriverState = {
#else
static cmsis_i2c_dma_driver_state_t I2C7_DmaDriverState = {
    #endif
    &I2C7_Resource,
    &I2C7_DmaResource,
    &I2C7_DmaHandle,
    &I2C7_DmaTxRxHandle,
};

static int32_t I2C7_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event) {
    #ifdef RTE_I2C7_PIN_INIT
    RTE_I2C7_PIN_INIT();
    #endif
    return I2C_Master_DmaInitialize(cb_event, &I2C7_DmaDriverState);
}

static int32_t I2C7_Master_DmaUninitialize(void) {
    #ifdef RTE_I2C7_PIN_DEINIT
    RTE_I2C7_PIN_DEINIT();
    #endif
    return I2C_Master_DmaUninitialize(&I2C7_DmaDriverState);
}

static int32_t I2C7_Master_DmaPowerControl(ARM_POWER_STATE state) {
    return I2C_Master_DmaPowerControl(state, &I2C7_DmaDriverState);
}

static int32_t I2C7_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C7_DmaDriverState);
}

static int32_t I2C7_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C7_DmaDriverState);
}

static int32_t I2C7_Master_DmaGetDataCount(void) {
    return I2C_Master_DmaGetDataCount(&I2C7_DmaDriverState);
}

static int32_t I2C7_Master_DmaControl(uint32_t control, uint32_t arg) {
    return I2C_Master_DmaControl(control, arg, &I2C7_DmaDriverState);
}

static ARM_I2C_STATUS I2C7_Master_DmaGetStatus(void) {
    return I2C_Master_DmaGetStatus(&I2C7_DmaDriverState);
}

#endif

#else
static cmsis_i2c_handle_t I2C7_handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c7_interrupt_driver_state")
static cmsis_i2c_interrupt_driver_state_t I2C7_InterruptDriverState = {
#else
static cmsis_i2c_interrupt_driver_state_t I2C7_InterruptDriverState = {
    #endif
    &I2C7_Resource,
    &I2C7_handle,

};

static int32_t I2C7_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event) {
    #ifdef RTE_I2C7_PIN_INIT
    RTE_I2C7_PIN_INIT();
    #endif
    return I2C_InterruptInitialize(cb_event, &I2C7_InterruptDriverState);
}

static int32_t I2C7_InterruptUninitialize(void) {
    #ifdef RTE_I2C7_PIN_DEINIT
    RTE_I2C7_PIN_DEINIT();
    #endif
    return I2C_InterruptUninitialize(&I2C7_InterruptDriverState);
}

static int32_t I2C7_InterruptPowerControl(ARM_POWER_STATE state) {
    return I2C_InterruptPowerControl(state, &I2C7_InterruptDriverState);
}

static int32_t I2C7_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C7_InterruptDriverState);
}

static int32_t I2C7_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C7_InterruptDriverState);
}

static int32_t I2C7_Slave_InterruptTransmit(const uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptTransmit(data, num, &I2C7_InterruptDriverState);
}

static int32_t I2C7_Slave_InterruptReceive(uint8_t *data, uint32_t num) {
    return I2C_Slave_InterruptReceive(data, num, &I2C7_InterruptDriverState);
}

static int32_t I2C7_InterruptGetDataCount(void) {
    return I2C_InterruptGetDataCount(&I2C7_InterruptDriverState);
}

static int32_t I2C7_InterruptControl(uint32_t control, uint32_t arg) {
    return I2C_InterruptControl(control, arg, &I2C7_InterruptDriverState);
}

static ARM_I2C_STATUS I2C7_InterruptGetStatus(void) {
    return I2C_InterruptGetStatus(&I2C7_InterruptDriverState);
}

#endif

ARM_DRIVER_I2C Driver_I2C7 = {I2Cx_GetVersion,
                              I2Cx_GetCapabilities,
                              #if defined(RTE_I2C7_DMA_EN) && RTE_I2C7_DMA_EN
                              I2C7_Master_DmaInitialize,
                              I2C7_Master_DmaUninitialize,
                              I2C7_Master_DmaPowerControl,
                              I2C7_Master_DmaTransmit,
                              I2C7_Master_DmaReceive,
                              NULL,
                              NULL,
                              I2C7_Master_DmaGetDataCount,
                              I2C7_Master_DmaControl,
                              I2C7_Master_DmaGetStatus
                              #else
                              I2C7_InterruptInitialize,
                              I2C7_InterruptUninitialize,
                              I2C7_InterruptPowerControl,
                              I2C7_Master_InterruptTransmit,
                              I2C7_Master_InterruptReceive,
                              I2C7_Slave_InterruptTransmit,
                              I2C7_Slave_InterruptReceive,
                              I2C7_InterruptGetDataCount,
                              I2C7_InterruptControl,
                              I2C7_InterruptGetStatus
                              #endif
};

#endif

#if defined(I2C8) && defined(RTE_I2C8) && RTE_I2C8
/* User needs to provide the implementation for I2C8_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t I2C8_GetFreq(void);

static cmsis_i2c_resource_t I2C8_Resource = {I2C8, I2C8_GetFreq};

#if (defined(RTE_I2C8_DMA_EN) && RTE_I2C8_DMA_EN)

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

